[
  {
    "id": 1,
    "image": "https://cdn-icons-png.flaticon.com/512/2983/2983788.png",
    "title": "Notely",
    "companyName": "CreativeApps Ltd",
    "description": "Notely is a smooth and beautifully crafted note-taking app designed to help you capture ideas instantly, sync notes across devices, and organize them with smart tags. Notely is a clean, modern, and intuitive note-taking app designed to help you instantly capture ideas, tasks, and reminders with ease. It supports real-time cloud sync, ensuring your notes stay updated across all devices. With smart tagging, color organization, and pinned notes, you can quickly locate important information whenever needed. Notely includes voice-to-text support, image attachments, and auto-save to make note creation fast and effortless. Advanced encryption and an optional app lock keep your private notes secured. Whether you're a student, a professional, or a creative thinker, Notely provides a clutter-free space to organize your thoughts and stay productive.",
    "size": 42,
    "reviews": 12800,
    "ratingAvg": 4.6,
    "downloads": 5.2,
    "ratings": [
      { "name": "1 star", "count": 120 },
      { "name": "2 star", "count": 260 },
      { "name": "3 star", "count": 900 },
      { "name": "4 star", "count": 2800 },
      { "name": "5 star", "count": 6710 }
    ]
  },
  {
    "id": 2,
    "image": "https://cdn-icons-png.flaticon.com/512/868/868786.png",
    "title": "Swift Cleaner",
    "companyName": "Boostify Tech",
    "description": "Swift Cleaner boosts device performance with powerful junk cleaning, memory optimization, and battery-saving tools. Swift Cleaner is an all-in-one device optimization tool designed to boost speed, free storage, and enhance everyday performance. Its intelligent junk cleaner scans deeply to remove cache files, unused data, and system leftovers. The RAM booster ensures smoother multitasking and gaming by freeing background processes. Battery Saver extends device life by analyzing power-hungry apps, while the CPU Cooler reduces overheating for longer device durability. Swift Cleaner’s one-tap optimization and clean interface make it simple for anyone to maintain a fast, efficient device with minimal effort.",
    "size": 36,
    "reviews": 9800,
    "ratingAvg": 4.4,
    "downloads": 12.4,
    "ratings": [
      { "name": "1 star", "count": 220 },
      { "name": "2 star", "count": 390 },
      { "name": "3 star", "count": 1400 },
      { "name": "4 star", "count": 2600 },
      { "name": "5 star", "count": 4190 }
    ]
  },
  {
    "id": 3,
    "image": "https://cdn-icons-png.flaticon.com/512/2965/2965567.png",
    "title": "FitTrack Pro",
    "companyName": "Wellness Studio",
    "description":  "FitTrack Pro is your ultimate fitness companion, designed to help you achieve your health and wellness goals efficiently. The app provides personalized workout plans that adapt to your fitness level and progress over time. With smart calorie tracking, you can monitor your daily intake and understand how your nutrition impacts your performance. The progress charts give a visual overview of your workouts, calories burned, and weight trends. You can track your heart rate and other vital metrics during exercises for a holistic view of your health. FitTrack Pro also includes guided video tutorials, ensuring correct form and preventing injuries. The app allows you to set reminders for workouts, hydration, and sleep, making it easier to maintain a balanced lifestyle. For motivation, it offers achievement badges, streak tracking, and challenges with friends. Users can create custom workout routines, mixing cardio, strength, and flexibility exercises according to their needs. Detailed analytics provide insights on which workouts are most effective, helping you optimize your training. Integration with wearable devices ensures seamless data sync and real-time feedback. The minimalist interface is designed to reduce cognitive load, keeping you focused on your goals. FitTrack Pro also offers meditation and recovery exercises to improve mental wellness. Notifications gently guide you throughout the day without being intrusive. Whether you are a beginner or an advanced athlete, the app adapts to your pace. FitTrack Pro makes fitness engaging, structured, and sustainable, combining tracking, guidance, and motivation in one platform.",
    "size": 54,
    "reviews": 16500,
    "ratingAvg": 4.7,
    "downloads": 8.9,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 220 },
      { "name": "3 star", "count": 900 },
      { "name": "4 star", "count": 4100 },
      { "name": "5 star", "count": 11180 }
    ]
  },
  {
    "id": 4,
    "image": "https://cdn-icons-png.flaticon.com/512/1829/1829586.png",
    "title": "PhotoCraft",
    "companyName": "PixelForge",
    "description": "PhotoCraft offers AI-powered filters, retouch tools, and pro-level editing features to transform your images instantly. PhotoCraft is an advanced AI-powered photo editing app built for creators who want professional results in seconds. With intelligent retouching tools, PhotoCraft automatically enhances skin tone, lighting, and colors with precision. You can apply premium filters, remove backgrounds instantly, use overlays, adjust exposure, and create stunning visual compositions using layer-based editing. The app includes animated effects, text styling, stickers, and transformation tools for complete creative control. Designed for photographers, content creators, and everyday users, PhotoCraft makes high-quality editing fast, simple, and incredibly powerful.",
    "size": 71,
    "reviews": 18700,
    "ratingAvg": 4.5,
    "downloads": 15.3,
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 450 },
      { "name": "3 star", "count": 1600 },
      { "name": "4 star", "count": 5200 },
      { "name": "5 star", "count": 11250 }
    ]
  },
  {
    "id": 5,
    "image": "https://cdn-icons-png.flaticon.com/512/684/684908.png",
    "title": "TravelMate",
    "companyName": "GoWorld Inc.",
    "description": "TravelMate gives you flight tracking, hotel suggestions, offline maps, and real-time travel alerts. TravelMate is your smart digital travel assistant, designed to simplify every part of your journey. The app provides real-time flight tracking, hotel suggestions, currency conversions, and live travel alerts. Its offline maps ensure you can navigate confidently without internet access. The trip planner helps you organize day-to-day itineraries, while destination-based recommendations highlight top places to visit, eat, and explore. With additional tools like packing reminders, safety alerts, and budget tracking, TravelMate is the perfect companion for both frequent travelers and occasional adventurers.",
    "size": 63,
    "reviews": 9200,
    "ratingAvg": 4.3,
    "downloads": 6.1,
    "ratings": [
      { "name": "1 star", "count": 240 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1300 },
      { "name": "4 star", "count": 2600 },
      { "name": "5 star", "count": 3660 }
    ]
  },
  {
    "id": 6,
    "image": "https://cdn-icons-png.flaticon.com/512/1170/1170678.png",
    "title": "FinanceFlow",
    "companyName": "MoneySoft",
    "description": "FinanceFlow helps track expenses, manage budgets, monitor subscriptions, and optimize your financial goals. FinanceFlow is a powerful personal finance manager that helps you track expenses, monitor subscriptions, and build smarter budgeting habits. Its intelligent analytics system identifies spending patterns and provides long-term savings recommendations. The app features category-based expense tracking, bill reminders, multi-wallet support, and detailed monthly financial reports. With secure encryption and privacy-focused design, your financial data stays protected at all times. Whether you want to save more, spend better, or understand your financial flow, this app brings clarity and control to your money.",
    "size": 45,
    "reviews": 14900,
    "ratingAvg": 4.6,
    "downloads": 11.2,
    "ratings": [
      { "name": "1 star", "count": 180 },
      { "name": "2 star", "count": 310 },
      { "name": "3 star", "count": 1100 },
      { "name": "4 star", "count": 3900 },
      { "name": "5 star", "count": 8410 }
    ]
  },
  {
    "id": 7,
    "image": "https://cdn-icons-png.flaticon.com/512/9715/9715288.png",
    "title": "TaskFlow",
    "companyName": "Prodify Apps",
    "description": "TaskFlow helps you manage projects, deadlines, priorities, and team collaboration with ease. TaskFlow is a modern productivity tool built for managing tasks, deadlines, and collaborative projects with ease. The app supports to-do lists, priority levels, reminders, and progress boards that help you stay organized throughout the day. For teams, TaskFlow offers shared workspaces, file attachments, and real-time updates to ensure smooth collaboration. Visual progress charts, daily check-ins, and smart suggestions help you maintain focus and hit every deadline. From personal tasks to large team projects, TaskFlow gives you a structured, efficient workflow.",
    "size": 28,
    "reviews": 6800,
    "ratingAvg": 4.2,
    "downloads": 4.8,
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 450 },
      { "name": "3 star", "count": 1100 },
      { "name": "4 star", "count": 1700 },
      { "name": "5 star", "count": 3250 }
    ]
  },
  {
    "id": 8,
    "image": "https://cdn-icons-png.flaticon.com/512/2729/2729007.png",
    "title": "EduMaster",
    "companyName": "LearnHub",
    "description": "EduMaster includes online courses, quizzes, study materials, and personalized learning paths. EduMaster is an intelligent learning platform offering personalized study paths, online courses, quizzes, and progress analytics. The app adapts to your learning speed and highlights areas where you need improvement. Interactive lessons, practice tests, flashcards, and study materials help you prepare effectively for exams and skill development. EduMaster includes motivation tools such as streak tracking, performance badges, and learning reminders. With downloadable lessons for offline study and a clean, distraction-free interface, this app makes learning smarter and more enjoyable.",
    "size": 59,
    "reviews": 13400,
    "ratingAvg": 4.8,
    "downloads": 9.5,
    "ratings": [
      { "name": "1 star", "count": 80 },
      { "name": "2 star", "count": 160 },
      { "name": "3 star", "count": 700 },
      { "name": "4 star", "count": 3200 },
      { "name": "5 star", "count": 9260 }
    ]
  },
  {
    "id": 9,
    "image": "https://cdn-icons-png.flaticon.com/512/2965/2965879.png",
    "title": "NewsHub",
    "companyName": "DailyTech Media",
    "description": "NewsHub gives real-time breaking news, category filters, notifications, and offline reading support. NewsHub delivers fast, reliable, and real-time news updates from trusted sources worldwide. You can browse through categories like technology, sports, politics, entertainment, and business with personalized content suggestions based on your reading habits. Offline reading ensures you stay informed even without internet access. With breaking news alerts, reading mode, bookmark support, and a clean interface, NewsHub keeps you connected to global events effortlessly. It’s the perfect platform for anyone who wants accurate news anytime, anywhere.",
    "size": 34,
    "reviews": 7400,
    "ratingAvg": 4.0,
    "downloads": 7.1,
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 1600 },
      { "name": "5 star", "count": 2800 }
    ]
  },
  {
    "id": 10,
    "image": "https://cdn-icons-png.flaticon.com/512/726/726623.png",
    "title": "ChatWave",
    "companyName": "WaveTech",
    "description": "ChatWave provides secure messaging, HD calls, media sharing, and encrypted chats for complete privacy. ChatWave is a secure communication platform featuring encrypted messaging, HD voice calls, and high-quality media sharing. The app ensures complete privacy with end-to-end encryption, secure cloud backups, and disappearing messages. You can create group chats, share large files, send voice notes, and enjoy smooth connections even on low networks. ChatWave also includes customizable themes, emojis, and chat wallpapers for a personalized experience. It’s designed for users who want fast, reliable, and private communication.",
    "size": 78,
    "reviews": 26500,
    "ratingAvg": 4.7,
    "downloads": 22.3,
    "ratings": [
      { "name": "1 star", "count": 430 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 2100 },
      { "name": "4 star", "count": 6500 },
      { "name": "5 star", "count": 18570 }
    ]
  },
  {
    "id": 11,
    "image": "https://cdn-icons-png.flaticon.com/512/727/727218.png",
    "title": "MusicBeats",
    "companyName": "TuneSphere",
    "description": "MusicBeats lets you stream music, create playlists, discover artists, and enjoy offline songs. MusicBeats is your ultimate music streaming app packed with millions of songs, playlists, and artist recommendations. The app lets you explore genres, create custom playlists, save favorites, and listen offline without interruptions. Personalized discovery tools suggest new songs based on your listening mood and habits. MusicBeats also includes equalizer settings, sleep timer, and high-resolution audio support for the best listening experience. Whether you're working, relaxing, or traveling, MusicBeats brings the perfect soundtrack to your day.",
    "size": 88,
    "reviews": 31000,
    "ratingAvg": 4.8,
    "downloads": 30.4,
    "ratings": [
      { "name": "1 star", "count": 350 },
      { "name": "2 star", "count": 620 },
      { "name": "3 star", "count": 1400 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 23630 }
    ]
  },
  {
    "id": 12,
    "image": "https://cdn-icons-png.flaticon.com/512/854/854929.png",
    "title": "MapGo",
    "companyName": "GeoSoft",
    "description": "MapGo offers real-time GPS navigation, smart route suggestions, and offline downloadable maps. MapGo is a smart navigation app offering real-time GPS guidance, accurate traffic updates, and intelligent route suggestions. The app supports downloadable offline maps, ensuring you can navigate anywhere—even without a network. With voice-guided directions, lane assistance, speed alerts, and location sharing, MapGo keeps your journey smooth and safe. Whether you're driving, cycling, or walking, the app ensures you reach your destination quickly and confidently.",
    "size": 66,
    "reviews": 19800,
    "ratingAvg": 4.5,
    "downloads": 13.9,
    "ratings": [
      { "name": "1 star", "count": 280 },
      { "name": "2 star", "count": 640 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 3900 },
      { "name": "5 star", "count": 11480 }
    ]
  },
  {
    "id": 13,
    "image": "https://cdn-icons-png.flaticon.com/512/3208/3208676.png",
    "title": "WeatherLive",
    "companyName": "SkyNet Apps",
    "description": "WeatherLive delivers accurate forecasts, storm alerts, radar maps, and real-time temperature tracking. WeatherLive provides highly accurate weather forecasts with detailed hourly and weekly predictions. The app includes storm alerts, radar maps, UV index, humidity levels, and wind tracking to help you plan your day better. Real-time temperature updates and live rain notifications ensure you stay prepared for any sudden weather change. With interactive radar maps and a clean interface, WeatherLive is a dependable weather companion for everyday life.",
    "size": 41,
    "reviews": 11200,
    "ratingAvg": 4.4,
    "downloads": 9.8,
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 480 },
      { "name": "3 star", "count": 1300 },
      { "name": "4 star", "count": 3000 },
      { "name": "5 star", "count": 5120 }
    ]
  },
  {
    "id": 14,
    "image": "https://cdn-icons-png.flaticon.com/512/4840/4840561.png",
    "title": "HealthBuddy",
    "companyName": "MediCore Labs",
    "description": "HealthBuddy tracks your sleep, steps, heart rate, hydration, and provides daily wellness recommendations. HealthBuddy is your all-in-one wellness tracker designed to monitor sleep cycles, heart rate, hydration, steps, and daily health habits. The app generates personalized health insights and gives gentle reminders to keep you active and hydrated. With guided breathing exercises, wellness tips, and progress analytics, HealthBuddy helps you develop a balanced lifestyle. The intuitive interface and daily goals motivate you to stay consistent and improve overall well-being.",
    "size": 52,
    "reviews": 17400,
    "ratingAvg": 4.6,
    "downloads": 11.7,
    "ratings": [
      { "name": "1 star", "count": 240 },
      { "name": "2 star", "count": 360 },
      { "name": "3 star", "count": 1100 },
      { "name": "4 star", "count": 3700 },
      { "name": "5 star", "count": 10000 }
    ]
  },
  {
    "id": 15,
    "image": "https://cdn-icons-png.flaticon.com/512/5087/5087579.png",
    "title": "ShopSmart",
    "companyName": "BuyRight Ltd.",
    "description": "ShopSmart finds best deals, compares prices, tracks sales, and sends discount alerts instantly. ShopSmart is a smart shopping assistant that helps you find the best deals, compare prices, and track discounts across thousands of products. The app scans e-commerce platforms to highlight real-time offers and price drops. With wishlist tracking, coupon alerts, trend insights, and personalized recommendations, ShopSmart ensures you never overspend. Whether you're buying electronics, fashion, or groceries, the app helps you shop smarter and save more.",
    "size": 47,
    "reviews": 8800,
    "ratingAvg": 4.3,
    "downloads": 7.6,
    "ratings": [
      { "name": "1 star", "count": 260 },
      { "name": "2 star", "count": 420 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 2600 },
      { "name": "5 star", "count": 4320 }
    ]
  },
  {
    "id": 16,
    "image": "https://cdn-icons-png.flaticon.com/512/4697/4697260.png",
    "title": "VideoCraft",
    "companyName": "UltraEdit Co.",
    "description": "VideoCraft provides pro-level tools for trimming, effects, transitions, overlays, and AI auto-editing. VideoCraft is a high-end video editing app designed for creators who want powerful tools on the go. It offers trimming, transitions, filters, overlays, motion effects, and AI auto-editing for instant video enhancement. You can work with multiple layers, add text animations, adjust audio, and export high-resolution videos quickly. Ideal for vloggers, editors, and social media creators, VideoCraft makes professional editing accessible and fast on mobile devices.",
    "size": 92,
    "reviews": 22400,
    "ratingAvg": 4.7,
    "downloads": 18.4,
    "ratings": [
      { "name": "1 star", "count": 310 },
      { "name": "2 star", "count": 520 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 5100 },
      { "name": "5 star", "count": 15470 }
    ]
  },
  {
    "id": 17,
    "image": "https://cdn-icons-png.flaticon.com/512/2721/2721267.png",
    "title": "FoodZone",
    "companyName": "QuickEats",
    "description": "FoodZone helps you order food, track deliveries, explore restaurants, and get personalized suggestions. FoodZone is a smart food delivery and restaurant discovery app that helps you explore cuisines, track deliveries, and get personalized food recommendations. The app displays menu details, ratings, delivery times, and deals in real-time. With order tracking, re-ordering options, and location-based suggestions, FoodZone ensures a smooth and enjoyable food-ordering experience. Whether you’re craving something new or ordering your favorite meal, FoodZone brings convenience to your doorstep.",
    "size": 58,
    "reviews": 19300,
    "ratingAvg": 4.5,
    "downloads": 16.1,
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 480 },
      { "name": "3 star", "count": 1600 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 10970 }
    ]
  },
  {
    "id": 18,
    "image": "https://cdn-icons-png.flaticon.com/512/1828/1828911.png",
    "title": "MindSpace",
    "companyName": "Calmify Studio",
    "description": "MindSpace offers guided meditation, stress relief tools, breathing exercises, and sleep soundscapes. MindSpace is a calming meditation and mental wellness app created to reduce stress, improve focus, and enhance sleep quality. It features guided meditation sessions, breathing exercises, mindfulness techniques, and soothing soundscapes. The app tracks your mood, progress, and daily habits to give personalized wellness suggestions. Whether you're trying to relax, sleep better, or clear your mind, MindSpace helps you build a peaceful, balanced lifestyle.",
    "size": 39,
    "reviews": 9400,
    "ratingAvg": 4.6,
    "downloads": 5.7,
    "ratings": [
      { "name": "1 star", "count": 120 },
      { "name": "2 star", "count": 260 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 2600 },
      { "name": "5 star", "count": 5620 }
    ]
  },
  {
    "id": 19,
    "image": "https://cdn-icons-png.flaticon.com/512/4206/4206277.png",
    "title": "SecureVault",
    "companyName": "LockIt Labs",
    "description": "SecureVault stores passwords, encrypts files, and protects your digital identity with advanced security. SecureVault is a powerful digital security tool that protects passwords, encrypts files, and secures your online identity with advanced protocols. The built-in password manager generates strong passwords and stores them safely with biometric lock support. Secure file storage ensures your documents stay private and inaccessible to unauthorized users. With breach alerts, secure notes, and auto-fill support, SecureVault keeps your digital life protected and organized.",
    "size": 31,
    "reviews": 7700,
    "ratingAvg": 4.4,
    "downloads": 4.2,
    "ratings": [
      { "name": "1 star", "count": 210 },
      { "name": "2 star", "count": 310 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 2200 },
      { "name": "5 star", "count": 3970 }
    ]
  },
  {
    "id": 20,
    "image": "https://cdn-icons-png.flaticon.com/512/483/483947.png",
    "title": "BookNest",
    "companyName": "Readify Global",
    "description": "BookNest gives you ebooks, audiobooks, reading stats, bookmarks, and personalized book suggestions. BookNest is a complete reading hub offering ebooks, audiobooks, bookmarks, highlights, and personalized recommendations. The app adapts to your reading preferences and tracks your progress across devices. With adjustable fonts, dark mode, offline reading, and listening options, BookNest provides a comfortable, immersive reading experience. Whether you're expanding knowledge, enjoying fiction, or listening on the go, BookNest is built for every type of reader.",
    "size": 69,
    "reviews": 15800,
    "ratingAvg": 4.7,
    "downloads": 10.3,
    "ratings": [
      { "name": "1 star", "count": 180 },
      { "name": "2 star", "count": 290 },
      { "name": "3 star", "count": 900 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 9930 }
    ]
  }
]
